---
kind: method
id: M:Autodesk.Revit.DB.RepeatingReferenceSource.GetBounds
source: html/967a1bea-609d-0da3-c5ff-b37efbf45686.htm
---
# Autodesk.Revit.DB.RepeatingReferenceSource.GetBounds Method

Returns information about the boundaries of the repeating reference array.

## Syntax (C#)
```csharp
public RepeaterBounds GetBounds()
```

## Returns
The bounds of the repeating reference source.

## Remarks
See the RepeaterBounds structure for more information about repeating reference source bounds.

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - The repeating reference source is no longer valid.